In [32]:
import pandas as pd
import numpy as np

#Dataframe
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}
data

In [33]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [34]:
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [35]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [36]:
df.tail(2)

    Name   Age Department   Salary
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [37]:
#loc and iloc
df.iloc[1:3,1:2]

    Age
1  30.0
2  35.0

In [38]:
df.loc[1:2,["Age","Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance

In [39]:
df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [40]:
df[["Age","Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [41]:
df.drop("Age",axis =1)

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [42]:
df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [43]:
df.drop("Age", axis = 1)

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [44]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [45]:
df.shape

(6, 4)

In [46]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      str
 1   Age         5 non-null      float64
 2   Department  6 non-null      str
 3   Salary      5 non-null      float64
dtypes: float64(2), str(2)
memory usage: 324.0 bytes

In [47]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [51]:
# Broadcasting
df["Salary"] = df["Salary"]+5000
df["Salary"]
# df.dtypes

Name              str
Age           float64
Department        str
Salary        float64
dtype: object

In [53]:
#Renaming column
df.rename(columns = {"Department" : "Dept"},inplace = True)
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  70000.0
1      Bob  30.0       IT  80000.0
2  Charlie  35.0  Finance  90000.0
3    David   NaN       IT  82000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  70000.0

In [58]:
df["Dept"].unique()

<StringArray>
['HR', 'IT', 'Finance']
Length: 3, dtype: str

In [61]:
df["Dept"].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [69]:
df["Promoted Salary"] = df["Salary"] * 10
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  70000.0         700000.0
1      Bob  30.0       IT  80000.0         800000.0
2  Charlie  35.0  Finance  90000.0         900000.0
3    David   NaN       IT  82000.0         820000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  70000.0         700000.0

In [70]:
#Data Cleaning
df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [74]:
df.dropna(how = "all") #if all the values in any row are null

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  70000.0         700000.0
1      Bob  30.0       IT  80000.0         800000.0
2  Charlie  35.0  Finance  90000.0         900000.0
3    David   NaN       IT  82000.0         820000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  70000.0         700000.0

In [76]:
df.dropna(how = "any")

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  70000.0         700000.0
1      Bob  30.0       IT  80000.0         800000.0
2  Charlie  35.0  Finance  90000.0         900000.0
5    Alice  25.0       HR  70000.0         700000.0

In [80]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [81]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [85]:
df["Salary"].fillna(df["Salary"].median())

0    70000.0
1    80000.0
2    90000.0
3    82000.0
4    80000.0
5    70000.0
Name: Salary, dtype: float64

In [92]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [93]:
df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [99]:
df["Age"].fillna(method = "backfill")

TypeError: NDFrame.fillna() got an unexpected keyword argument 'method'

In [100]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  70000.0         700000.0
1      Bob  30.0       IT  80000.0         800000.0
2  Charlie  35.0  Finance  90000.0         900000.0
3    David   NaN       IT  82000.0         820000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  70000.0         700000.0

In [103]:
df["Name"] = df["Name"].replace("Charlie","Rose")
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  70000.0         700000.0
1    Bob  30.0       IT  80000.0         800000.0
2   Rose  35.0  Finance  90000.0         900000.0
3  David   NaN       IT  82000.0         820000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  70000.0         700000.0

In [107]:
df_dup = df[df.duplicated(keep="last")]
df_dup

    Name   Age Dept   Salary  Promoted Salary
0  Alice  25.0   HR  70000.0         700000.0

In [108]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  70000.0         700000.0
1    Bob  30.0       IT  80000.0         800000.0
2   Rose  35.0  Finance  90000.0         900000.0
3  David   NaN       IT  82000.0         820000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  70000.0         700000.0

In [113]:
#invalid salary
df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x:x/10 if x > 65000 else x)
df["Promoted Salary"]

0    7000.0
1    8000.0
2    9000.0
3    8200.0
4       NaN
5    7000.0
Name: Promoted Salary, dtype: float64

In [118]:
#apply and lambda
def multipy_age(x):
    return x*2
df["Age"] = df["Age"].apply(multipy_age)
df

    Name    Age     Dept   Salary  Promoted Salary
0  Alice  400.0       HR  70000.0           7000.0
1    Bob  480.0       IT  80000.0           8000.0
2   Rose  560.0  Finance  90000.0           9000.0
3  David    NaN       IT  82000.0           8200.0
4    Eve  464.0       HR      NaN              NaN
5  Alice  400.0       HR  70000.0           7000.0

In [119]:
df["Age"] = df["Age"].apply(lambda x:x/2)

In [122]:
df["Age"]
df

    Name    Age     Dept   Salary  Promoted Salary
0  Alice  200.0       HR  70000.0           7000.0
1    Bob  240.0       IT  80000.0           8000.0
2   Rose  280.0  Finance  90000.0           9000.0
3  David    NaN       IT  82000.0           8200.0
4    Eve  232.0       HR      NaN              NaN
5  Alice  200.0       HR  70000.0           7000.0

In [124]:
#Join and merge
department_info = {
    "Department": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}
df2 = pd.DataFrame(department_info)
df2

  Department       Location Manager
0         HR       New York   Laura
1         IT  San Francisco   Steve
2    Finance        Chicago    Nina

In [125]:
df[]
pd.concat([df,df2])

,Name,Age,Dept,Salary,Promoted Salary,Department,Location,Manager
0,Alice,200.0,HR,70000.0,7000.0,NaN,NaN,NaN
1,Bob,240.0,IT,80000.0,8000.0,NaN,NaN,NaN
2,Rose,280.0,Finance,90000.0,9000.0,NaN,NaN,NaN
3,David,NaN,IT,82000.0,8200.0,NaN,NaN,NaN
4,Eve,232.0,HR,NaN,NaN,NaN,NaN,NaN
5,Alice,200.0,HR,70000.0,7000.0,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,HR,New York,Laura
1,NaN,NaN,NaN,NaN,NaN,IT,San Francisco,Steve
2,NaN,NaN,NaN,NaN,NaN,Finance,Chicago,Nina